In [1]:
import pandas as pd
import numpy as np
from scipy.stats import mode

### Iris Dataset

In [2]:
iris = pd.read_csv("../Data_Science_Learning/iris.csv")

In [3]:
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [4]:
iris.isnull().values.any() # does dataset has any null values or not

False

In [5]:
iris.isnull().sum()  # count of null values by each column

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

In [6]:
iris.dtypes  # data types

Id                 int64
SepalLengthCm    float64
SepalWidthCm     float64
PetalLengthCm    float64
PetalWidthCm     float64
Species           object
dtype: object

In [7]:
iris.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [8]:
iris.Species.unique() # Unique species

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [9]:
iris.Species.value_counts() # Count of each species

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: Species, dtype: int64

# Pivot Tables

In [10]:
iris.pivot_table(index=["Species"], values=["SepalLengthCm", "PetalLengthCm"], aggfunc= [np.mean, np.max, np.min])

                         mean                        amax                \
                PetalLengthCm SepalLengthCm PetalLengthCm SepalLengthCm
Species
Iris-setosa             1.464         5.006           1.9           5.8
Iris-versicolor         4.260         5.936           5.1           7.0
Iris-virginica          5.552         6.588           6.9           7.9

                         amin
                PetalLengthCm SepalLengthCm
Species
Iris-setosa               1.0           4.3
Iris-versicolor           3.0           4.9
Iris-virginica            4.5           4.9

### Adult Dataset

In [11]:
adult = pd.read_csv("../Data_Science_Learning/adult.csv")

In [12]:
adult.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,?,77053,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,4356,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
2,66,?,186061,Some-college,10,Widowed,?,Unmarried,Black,Female,0,4356,40,United-States,<=50K
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K

### Columns in a data set

In [13]:
adult.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education.num',
       'marital.status', 'occupation', 'relationship', 'race', 'sex',
       'capital.gain', 'capital.loss', 'hours.per.week', 'native.country',
       'income'],
      dtype='object')

### Data types of each variable

In [14]:
adult.dtypes

age                int64
workclass         object
fnlwgt             int64
education         object
education.num      int64
marital.status    object
occupation        object
relationship      object
race              object
sex               object
capital.gain       int64
capital.loss       int64
hours.per.week     int64
native.country    object
income            object
dtype: object

### Handling Null values

In [15]:
adult.isnull().values.any() # null values if at all present in the data.
# There seems to be some problem as we can clearly see ? which are not detected as null

False

In [16]:
adult.isnull().sum() # Checking by each column

age               0
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
income            0
dtype: int64

### Replace '?' into None

We have to replace the '?' into None to make it detect as null values However we can also replace as Nan.

In [17]:
adult.replace('?', np.nan, inplace = True)
#adult.replace({'?':None}, inplace = True)

In [18]:
adult.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,NaN,77053,HS-grad,9,Widowed,NaN,Not-in-family,White,Female,0,4356,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
2,66,NaN,186061,Some-college,10,Widowed,NaN,Unmarried,Black,Female,0,4356,40,United-States,<=50K
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K

In [19]:
adult.isnull().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week       0
native.country     583
income               0
dtype: int64

In [20]:
adult.columns[adult.isnull().any()].tolist() # displays only the columns having null values

['workclass', 'occupation', 'native.country']

In [21]:
all_null = adult[(adult['workclass'].isnull()) & (adult['occupation'].isnull() & (adult['native.country'].isnull()))]
all_null.head()  # Records where  workclass, occupation and native country are null

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
1181,68,NaN,286869,7th-8th,4,Widowed,NaN,Not-in-family,White,Female,0,1668,40,NaN,<=50K
1204,41,NaN,211873,Assoc-voc,11,Married-civ-spouse,NaN,Wife,White,Female,0,1628,5,NaN,<=50K
2591,38,NaN,94559,Bachelors,13,Married-civ-spouse,NaN,Wife,Other,Female,7688,0,50,NaN,>50K
3415,47,NaN,174525,HS-grad,9,Married-civ-spouse,NaN,Husband,White,Male,3942,0,40,NaN,<=50K
3508,39,NaN,157443,Masters,14,Married-civ-spouse,NaN,Wife,Asian-Pac-Islander,Female,3464,0,40,NaN,<=50K

# Frequency for Categorical Variable

In [22]:
def vc(x):
    print(x.value_counts())

In [23]:
vc(adult['workclass']), vc(adult['education'])

Private             22696
Self-emp-not-inc     2541
Local-gov            2093
State-gov            1298
Self-emp-inc         1116
Federal-gov           960
Without-pay            14
Never-worked            7
Name: workclass, dtype: int64
HS-grad         10501
Some-college     7291
Bachelors        5355
Masters          1723
Assoc-voc        1382
11th             1175
Assoc-acdm       1067
10th              933
7th-8th           646
Prof-school       576
9th               514
12th              433
Doctorate         413
5th-6th           333
1st-4th           168
Preschool          51
Name: education, dtype: int64

(None, None)

# Remove Null Values

In [24]:
remove_null_adult = adult.dropna(how="any")

In [25]:
remove_null_adult.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
income            0
dtype: int64

In [26]:
len(remove_null_adult)

30162

In [27]:
len(adult)

32561

In [28]:
total_null_values = 32561 - 30162
total_null_values

2399

In [29]:
adult_null_wo = adult.dropna(subset=["workclass","occupation"])

In [30]:
adult_null_wo.isnull().sum()

age                 0
workclass           0
fnlwgt              0
education           0
education.num       0
marital.status      0
occupation          0
relationship        0
race                0
sex                 0
capital.gain        0
capital.loss        0
hours.per.week      0
native.country    556
income              0
dtype: int64

In [31]:
len(adult_null_wo)

30718

In [32]:
total_null_wc = 32561 - 30718
total_null_wc # Null value records combine for workclass and occupation

1843

# Imputing Null Values of a Categorical variable using Pivot Tables

In [33]:
adult.workclass.unique()

array([nan, 'Private', 'State-gov', 'Federal-gov', 'Self-emp-not-inc',
       'Self-emp-inc', 'Local-gov', 'Without-pay', 'Never-worked'], dtype=object)

In [34]:
adult.occupation.unique()

array([nan, 'Exec-managerial', 'Machine-op-inspct', 'Prof-specialty',
       'Other-service', 'Adm-clerical', 'Craft-repair', 'Transport-moving',
       'Handlers-cleaners', 'Sales', 'Farming-fishing', 'Tech-support',
       'Protective-serv', 'Armed-Forces', 'Priv-house-serv'], dtype=object)

In [35]:
adult['native.country'].unique()

array(['United-States', nan, 'Mexico', 'Greece', 'Vietnam', 'China',
       'Taiwan', 'India', 'Philippines', 'Trinadad&Tobago', 'Canada',
       'South', 'Holand-Netherlands', 'Puerto-Rico', 'Poland', 'Iran',
       'England', 'Germany', 'Italy', 'Japan', 'Hong', 'Honduras', 'Cuba',
       'Ireland', 'Cambodia', 'Peru', 'Nicaragua', 'Dominican-Republic',
       'Haiti', 'El-Salvador', 'Hungary', 'Columbia', 'Guatemala',
       'Jamaica', 'Ecuador', 'France', 'Yugoslavia', 'Scotland',
       'Portugal', 'Laos', 'Thailand', 'Outlying-US(Guam-USVI-etc)'], dtype=object)

In [36]:
impute_oc = adult.pivot_table(values= 'occupation', columns= ['education', 'sex'],aggfunc=lambda x: x.mode().iat[0])
print(impute_oc)   # Occupation can be predicted on the person's education and gender.

education     sex
10th          Female        Other-service
              Male           Craft-repair
11th          Female        Other-service
              Male           Craft-repair
12th          Female        Other-service
              Male           Craft-repair
1st-4th       Female        Other-service
              Male           Craft-repair
5th-6th       Female    Machine-op-inspct
              Male          Other-service
7th-8th       Female        Other-service
              Male           Craft-repair
9th           Female        Other-service
              Male           Craft-repair
Assoc-acdm    Female         Adm-clerical
              Male           Craft-repair
Assoc-voc     Female         Adm-clerical
              Male           Craft-repair
Bachelors     Female       Prof-specialty
              Male        Exec-managerial
Doctorate     Female       Prof-specialty
              Male         Prof-specialty
HS-grad       Female         Adm-clerical
              Male           Craft-repair
Masters       Female       Prof-specialty
              Male         Prof-specialty
Preschool     Female        Other-service
              Male        Farming-fishing
Prof-school   Female       Prof-specialty
              Male         Prof-specialty
Some-college  Female         Adm-clerical
              Male           Craft-repair
dtype: object

In [37]:
type(impute_oc)
#adult['occupation'].fillna(impute_oc, inplace = True)

pandas.core.series.Series

In [38]:
pd.pivot_table(adult, values= ["hours.per.week"], index= ["native.country", "sex",],aggfunc= np.mean)

                                   hours.per.week
native.country             sex
Cambodia                   Female       40.000000
                           Male         41.062500
Canada                     Female       39.205128
                           Male         40.975610
China                      Female       36.000000
                           Male         38.481481
Columbia                   Female       37.791667
                           Male         39.942857
Cuba                       Female       34.925000
                           Male         42.236364
Dominican-Republic         Female       40.200000
                           Male         44.742857
Ecuador                    Female       30.555556
                           Male         43.842105
El-Salvador                Female       34.914286
                           Male         37.718310
England                    Female       41.281250
                           Male         42.137931
France                     Female       38.500000
                           Male         49.705882
Germany                    Female       35.533333
                           Male         45.285714
Greece                     Female       41.800000
                           Male         44.750000
Guatemala                  Female       39.600000
                           Male         39.068182
Haiti                      Female       34.250000
                           Male         39.125000
Holand-Netherlands         Female       40.000000
Honduras                   Female       36.000000
...                                           ...
Nicaragua                  Female       33.416667
                           Male         37.681818
Outlying-US(Guam-USVI-etc) Female       39.428571
                           Male         44.285714
Peru                       Female       39.214286
                           Male         32.235294
Philippines                Female       38.178082
                           Male         40.424000
Poland                     Female       34.526316
                           Male         40.097561
Portugal                   Female       38.833333
                           Male         43.360000
Puerto-Rico                Female       36.269231
                           Male         40.500000
Scotland                   Female       39.000000
                           Male         42.857143
South                      Female       37.966667
                           Male         45.080000
Taiwan                     Female       32.733333
                           Male         41.444444
Thailand                   Female       44.090909
                           Male         47.571429
Trinadad&Tobago            Female       33.818182
                           Male         42.250000
United-States              Female       36.326482
                           Male         42.495279
Vietnam                    Female       36.043478
                           Male         38.022727
Yugoslavia                 Female       33.333333
                           Male         47.153846

[81 rows x 1 columns]

In [39]:
pd.pivot_table(adult,index=["sex","occupation"],values=["capital.gain"],
               aggfunc=[np.sum, np.mean, np.max],fill_value=0, margins = True)

                                  sum         mean         amax
                         capital.gain capital.gain capital.gain
sex    occupation
Female Adm-clerical         1280580.0   504.761529      99999.0
       Craft-repair          168021.0   756.851351      99999.0
       Exec-managerial      1174675.0  1013.524590      99999.0
       Farming-fishing        67237.0  1034.415385      27828.0
       Handlers-cleaners      22259.0   135.725610       7443.0
       Machine-op-inspct      94731.0   172.238182      15024.0
       Other-service         278380.0   154.655556      99999.0
       Priv-house-serv        41104.0   291.517730      25236.0
       Prof-specialty       1963652.0  1296.139934      99999.0
       Protective-serv       126604.0  1665.842105      99999.0
       Sales                 350640.0   277.624703      27828.0
       Tech-support          229345.0   659.037356      99999.0
       Transport-moving       41106.0   456.733333      14344.0
Male   Adm-clerical          589170.0   477.834550      20051.0
       Armed-Forces               0.0     0.000000          0.0
       Craft-repair         2494332.0   643.366521      99999.0
       Exec-managerial      8025760.0  2760.839353      99999.0
       Farming-fishing       518951.0   558.612487      41310.0
       Handlers-cleaners     330616.0   274.142620      99999.0
       Machine-op-inspct     563305.0   387.951102      99999.0
       Other-service         351959.0   235.424080      99999.0
       Priv-house-serv          594.0    74.250000        594.0
       Prof-specialty       9324884.0  3552.336762      99999.0
       Protective-serv       332952.0   581.068063      34095.0
       Sales                4466737.0  1871.276498      99999.0
       Tech-support          395712.0   682.262069      27828.0
       Transport-moving      741941.0   492.329794      99999.0
All                        33975247.0  1106.037079      99999.0